{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "NightCaretaker",
			"Subnamespaces": [
				{
					"Namespace": "Editor",
					"Subnamespaces": [
						{
							"Namespace": "Metadata",
							"Children": [
								{
									"Source": {
										"Text": "Applies the current Reality Camera Tuning values to static camera state such as base transform and post-process settings."
									},
									"Translation": {
										"Text": "Applies the current Reality Camera Tuning values to static camera state such as base transform and post-process settings."
									},
									"Key": "NCRealityCameraComponent:ApplyRuntimeTuning.ToolTip"
								},
								{
									"Source": {
										"Text": "Camera component used for the mesh-free RealityCam viewpoint."
									},
									"Translation": {
										"Text": "Camera component used for the mesh-free RealityCam viewpoint."
									},
									"Key": "NCPlayerCharacter:RealityCameraComponent.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls how much RealityCam intensity remains while precision interaction mode is active."
									},
									"Translation": {
										"Text": "Controls how much RealityCam intensity remains while precision interaction mode is active."
									},
									"Key": "NCRealityCameraTuning:InteractionDampingFactor.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls how quickly idle procedural noise evolves over time."
									},
									"Translation": {
										"Text": "Controls how quickly idle procedural noise evolves over time."
									},
									"Key": "NCRealityCameraTuning:IdleNoiseFrequency.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls how quickly movement-driven camera responses are smoothed toward their targets."
									},
									"Translation": {
										"Text": "Controls how quickly movement-driven camera responses are smoothed toward their targets."
									},
									"Key": "NCRealityCameraTuning:MovementResponseSpeed.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls how quickly start and stop impulses recover once movement stabilizes."
									},
									"Translation": {
										"Text": "Controls how quickly start and stop impulses recover once movement stabilizes."
									},
									"Key": "NCRealityCameraTuning:StartStopRecoverySpeed.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls how quickly sudden movement impulses react to acceleration changes."
									},
									"Translation": {
										"Text": "Controls how quickly sudden movement impulses react to acceleration changes."
									},
									"Key": "NCRealityCameraTuning:StartStopResponseSpeed.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls how quickly the camera enters or leaves precision interaction damping."
									},
									"Translation": {
										"Text": "Controls how quickly the camera enters or leaves precision interaction damping."
									},
									"Key": "NCRealityCameraTuning:PrecisionModeInterpSpeed.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls how quickly turn inertia settles back toward neutral."
									},
									"Translation": {
										"Text": "Controls how quickly turn inertia settles back toward neutral."
									},
									"Key": "NCRealityCameraTuning:TurnLagSpeed.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the amount of positional idle noise used to avoid a rigid camera feel."
									},
									"Translation": {
										"Text": "Controls the amount of positional idle noise used to avoid a rigid camera feel."
									},
									"Key": "NCRealityCameraTuning:IdleNoiseLocationAmplitude.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the amount of rotational idle noise used for subtle handheld motion."
									},
									"Translation": {
										"Text": "Controls the amount of rotational idle noise used for subtle handheld motion."
									},
									"Key": "NCRealityCameraTuning:IdleNoiseRotationAmplitude.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the amount of scene fringe used by the restrained lens artifact pass."
									},
									"Translation": {
										"Text": "Controls the amount of scene fringe used by the restrained lens artifact pass."
									},
									"Key": "NCRealityCameraTuning:ChromaticAberrationIntensity.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the amount of yaw sway added while strafing."
									},
									"Translation": {
										"Text": "Controls the amount of yaw sway added while strafing."
									},
									"Key": "NCRealityCameraTuning:StrafeSwayYawAmplitude.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the base walk bob frequency used while moving."
									},
									"Translation": {
										"Text": "Controls the base walk bob frequency used while moving."
									},
									"Key": "NCRealityCameraTuning:WalkBobFrequency.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the blend weight of the lightweight RealityCam post-process layer."
									},
									"Translation": {
										"Text": "Controls the blend weight of the lightweight RealityCam post-process layer."
									},
									"Key": "NCRealityCameraTuning:PostProcessBlendWeight.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the forward camera shift caused by sudden starts and stops."
									},
									"Translation": {
										"Text": "Controls the forward camera shift caused by sudden starts and stops."
									},
									"Key": "NCRealityCameraTuning:StartStopLocationAmplitude.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the lateral camera translation applied against the strafe direction."
									},
									"Translation": {
										"Text": "Controls the lateral camera translation applied against the strafe direction."
									},
									"Key": "NCRealityCameraTuning:StrafeSwayLocationAmplitude.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the overall intensity of procedural RealityCam motion. Zero falls back to a near-static camera."
									},
									"Translation": {
										"Text": "Controls the overall intensity of procedural RealityCam motion. Zero falls back to a near-static camera."
									},
									"Key": "NCRealityCameraTuning:RealityCamIntensity.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the pitch kick caused by sudden starts and stops."
									},
									"Translation": {
										"Text": "Controls the pitch kick caused by sudden starts and stops."
									},
									"Key": "NCRealityCameraTuning:StartStopPitchAmplitude.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the pitch response contributed by the walk cycle at maximum normalized walk speed."
									},
									"Translation": {
										"Text": "Controls the pitch response contributed by the walk cycle at maximum normalized walk speed."
									},
									"Key": "NCRealityCameraTuning:WalkBobRotationAmplitude.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the vertical walk bob amplitude at maximum normalized walk speed."
									},
									"Translation": {
										"Text": "Controls the vertical walk bob amplitude at maximum normalized walk speed."
									},
									"Key": "NCRealityCameraTuning:WalkBobLocationAmplitude.ToolTip"
								},
								{
									"Source": {
										"Text": "Controls the vignette intensity used to focus attention toward the frame center."
									},
									"Translation": {
										"Text": "Controls the vignette intensity used to focus attention toward the frame center."
									},
									"Key": "NCRealityCameraTuning:VignetteIntensity.ToolTip"
								},
								{
									"Source": {
										"Text": "Default locomotion speed used by the current prototype character."
									},
									"Translation": {
										"Text": "Default locomotion speed used by the current prototype character."
									},
									"Key": "NCPlayerCharacter:RunSpeed.ToolTip"
								},
								{
									"Source": {
										"Text": "Default mapping context used for locomotion and general gameplay input."
									},
									"Translation": {
										"Text": "Default mapping context used for locomotion and general gameplay input."
									},
									"Key": "NCPlayerCharacter:DefaultInputMappingContext.ToolTip"
								},
								{
									"Source": {
										"Text": "Default playable character that uses the mesh-free RealityCam presentation."
									},
									"Translation": {
										"Text": "Default playable character that uses the mesh-free RealityCam presentation."
									},
									"Key": "NCPlayerCharacter.ToolTip"
								},
								{
									"Source": {
										"Text": "Default runtime game mode used by the main playable flow.\nBinds the standard player character and supporting framework classes."
									},
									"Translation": {
										"Text": "Default runtime game mode used by the main playable flow.\nBinds the standard player character and supporting framework classes."
									},
									"Key": "NCGameMode.ToolTip"
								},
								{
									"Source": {
										"Text": "Default runtime game state for the main game.\nTracks shift status, lighting state, and tension stage as the project grows."
									},
									"Translation": {
										"Text": "Default runtime game state for the main game.\nTracks shift status, lighting state, and tension stage as the project grows."
									},
									"Key": "NCGameState.ToolTip"
								},
								{
									"Source": {
										"Text": "Default runtime player controller for the main game.\nKeeps the input mode in a game-focused state for the Full Body First Person character."
									},
									"Translation": {
										"Text": "Default runtime player controller for the main game.\nKeeps the input mode in a game-focused state for the Full Body First Person character."
									},
									"Key": "NCPlayerController.ToolTip"
								},
								{
									"Source": {
										"Text": "Default runtime player state for the main game.\nRemains intentionally lightweight until player-specific persistent state is required."
									},
									"Translation": {
										"Text": "Default runtime player state for the main game.\nRemains intentionally lightweight until player-specific persistent state is required."
									},
									"Key": "NCPlayerState.ToolTip"
								},
								{
									"Source": {
										"Text": "Defines the baseline field of view before movement-driven widening is applied."
									},
									"Translation": {
										"Text": "Defines the baseline field of view before movement-driven widening is applied."
									},
									"Key": "NCRealityCameraTuning:BaseFOV.ToolTip"
								},
								{
									"Source": {
										"Text": "Defines the maximum additional field of view applied while moving at full walk speed."
									},
									"Translation": {
										"Text": "Defines the maximum additional field of view applied while moving at full walk speed."
									},
									"Key": "NCRealityCameraTuning:MoveFOVBoostMax.ToolTip"
								},
								{
									"Source": {
										"Text": "Defines the maximum pitch offset created by quick camera turns."
									},
									"Translation": {
										"Text": "Defines the maximum pitch offset created by quick camera turns."
									},
									"Key": "NCRealityCameraTuning:TurnPitchLagDegrees.ToolTip"
								},
								{
									"Source": {
										"Text": "Defines the maximum roll contribution created by strafing motion."
									},
									"Translation": {
										"Text": "Defines the maximum roll contribution created by strafing motion."
									},
									"Key": "NCRealityCameraTuning:MaxRollDegrees.ToolTip"
								},
								{
									"Source": {
										"Text": "Defines the maximum yaw offset created by quick camera turns."
									},
									"Translation": {
										"Text": "Defines the maximum yaw offset created by quick camera turns."
									},
									"Key": "NCRealityCameraTuning:TurnYawLagDegrees.ToolTip"
								},
								{
									"Source": {
										"Text": "Defines the resting camera offset relative to the owning pawn capsule."
									},
									"Translation": {
										"Text": "Defines the resting camera offset relative to the owning pawn capsule."
									},
									"Key": "NCRealityCameraTuning:BaseOffset.ToolTip"
								},
								{
									"Source": {
										"Text": "Enables or disables reduced-motion damping for precise inspection and interaction work."
									},
									"Translation": {
										"Text": "Enables or disables reduced-motion damping for precise inspection and interaction work."
									},
									"Key": "NCRealityCameraComponent:SetPrecisionInteractionEnabled.ToolTip"
								},
								{
									"Source": {
										"Text": "Enables the lightweight post-process layer used by the RealityCam presentation."
									},
									"Translation": {
										"Text": "Enables the lightweight post-process layer used by the RealityCam presentation."
									},
									"Key": "NCRealityCameraTuning:bEnablePostProcess.ToolTip"
								},
								{
									"Source": {
										"Text": "Groups all tunable parameters that control procedural RealityCam motion and post-processing."
									},
									"Translation": {
										"Text": "Groups all tunable parameters that control procedural RealityCam motion and post-processing."
									},
									"Key": "NCRealityCameraComponent:RealityCameraTuning.ToolTip"
								},
								{
									"Source": {
										"Text": "Input action expected to deliver a two-dimensional locomotion value."
									},
									"Translation": {
										"Text": "Input action expected to deliver a two-dimensional locomotion value."
									},
									"Key": "NCPlayerCharacter:MoveInputAction.ToolTip"
								},
								{
									"Source": {
										"Text": "Input action expected to deliver a two-dimensional look value for shared or gamepad input."
									},
									"Translation": {
										"Text": "Input action expected to deliver a two-dimensional look value for shared or gamepad input."
									},
									"Key": "NCPlayerCharacter:LookInputAction.ToolTip"
								},
								{
									"Source": {
										"Text": "Mouse-specific look action expected to deliver a two-dimensional look value."
									},
									"Translation": {
										"Text": "Mouse-specific look action expected to deliver a two-dimensional look value."
									},
									"Key": "NCPlayerCharacter:MouseLookInputAction.ToolTip"
								},
								{
									"Source": {
										"Text": "Optional mouse-specific mapping context layered on top of the base mapping."
									},
									"Translation": {
										"Text": "Optional mouse-specific mapping context layered on top of the base mapping."
									},
									"Key": "NCPlayerCharacter:MouseLookInputMappingContext.ToolTip"
								},
								{
									"Source": {
										"Text": "Procedural first-person camera component that adds restrained handheld realism."
									},
									"Translation": {
										"Text": "Procedural first-person camera component that adds restrained handheld realism."
									},
									"Key": "NCRealityCameraComponent.ToolTip"
								},
								{
									"Source": {
										"Text": "Returns whether precision interaction damping is currently enabled."
									},
									"Translation": {
										"Text": "Returns whether precision interaction damping is currently enabled."
									},
									"Key": "NCRealityCameraComponent:IsPrecisionInteractionEnabled.ToolTip"
								},
								{
									"Source": {
										"Text": "Sets the global intensity multiplier used by the procedural RealityCam layer."
									},
									"Translation": {
										"Text": "Sets the global intensity multiplier used by the procedural RealityCam layer."
									},
									"Key": "NCRealityCameraComponent:SetRealityCamIntensity.ToolTip"
								},
								{
									"Source": {
										"Text": "Shared parent for game state variants.\nKeep replicated or globally readable state here only when it truly applies to all modes."
									},
									"Translation": {
										"Text": "Shared parent for game state variants.\nKeep replicated or globally readable state here only when it truly applies to all modes."
									},
									"Key": "NCGameStateBase.ToolTip"
								},
								{
									"Source": {
										"Text": "Shared parent for player state variants.\nKeep this empty until a true cross-mode player state requirement appears."
									},
									"Translation": {
										"Text": "Shared parent for player state variants.\nKeep this empty until a true cross-mode player state requirement appears."
									},
									"Key": "NCPlayerStateBase.ToolTip"
								},
								{
									"Source": {
										"Text": "Shared parent for project character classes.\nKeep this layer free of game-specific behavior so runtime variants can inherit a stable baseline."
									},
									"Translation": {
										"Text": "Shared parent for project character classes.\nKeep this layer free of game-specific behavior so runtime variants can inherit a stable baseline."
									},
									"Key": "NCCharacterBase.ToolTip"
								},
								{
									"Source": {
										"Text": "Shared parent for project player controller variants.\nKeep cross-mode input or UI hooks here when they must be inherited everywhere."
									},
									"Translation": {
										"Text": "Shared parent for project player controller variants.\nKeep cross-mode input or UI hooks here when they must be inherited everywhere."
									},
									"Key": "NCPlayerControllerBase.ToolTip"
								},
								{
									"Source": {
										"Text": "Shared parent for runtime game mode variants.\nKeep global game rules that must apply to every mode here."
									},
									"Translation": {
										"Text": "Shared parent for runtime game mode variants.\nKeep global game rules that must apply to every mode here."
									},
									"Key": "NCGameModeBase.ToolTip"
								},
								{
									"Source": {
										"Text": "Tunable parameters for the camera-only realism pass used by the default first person presentation.\nThese values intentionally favor readability over aggressive found-footage distortion."
									},
									"Translation": {
										"Text": "Tunable parameters for the camera-only realism pass used by the default first person presentation.\nThese values intentionally favor readability over aggressive found-footage distortion."
									},
									"Key": "NCRealityCameraTuning.ToolTip"
								}
							]
						}
					]
				}
			]
		}
	]
}